# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [35]:
# Your code goes here
import pandas as pd
df1 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
df2 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv')
df3 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv')

In [38]:
three = (df1,df2,df3)

In [39]:
for data in three:
    data.columns = data.columns.str.lower()

In [49]:
for data in three:
    print(data.shape)
    
for data in three:
    column_names = data.columns
    print(column_names)

(4008, 11)
(996, 11)
(7070, 11)
Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')
Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')
Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [41]:
for data in three:
    
    data.columns = data.columns.str.replace(' ', '_')
    data.rename(columns={'st': 'state'}, inplace=True)

    data.loc[(data['gender'] == 'Femal') | (data['gender'] == 'female'), 'gender'] = 'F'

    data.loc[(data['gender'] == 'Male'),'gender'] = "M"
    data.loc[(data['education'] == 'Bachelors'), 'education'] = 'Bachelor'

    data['customer_lifetime_value'] = data['customer_lifetime_value'].astype(str).str.replace('%', '')

    data.loc[(data['vehicle_class'] == 'Sports Car') | (data['vehicle_class'] == 'Luxury SUV') | (data['vehicle_class'] == 'Luxury Car'), 'vehicle_class'] = 'Luxury'
    
    data['state'] = data['state'].astype(str).replace({'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington'})

In [42]:
df1.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,nan,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [43]:
df2.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30,71210,214,1/1/00,1027.2,Personal Auto,Luxury
4,WH52799,Arizona,F,College,380812.21,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [44]:
df3.head()

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.95848,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [45]:
df = pd.concat([df1, df2, df3], axis=0)
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,nan,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [46]:
df.shape

(12074, 11)

In [11]:
import numpy as np
print(np.unique(df['state'].astype(str)))

['Arizona' 'California' 'Nevada' 'Oregon' 'Washington' 'nan']

In [12]:
print (df['state'].value_counts())

state
California    3152
nan           2937
Oregon        2601
Arizona       1704
Nevada         882
Washington     798
Name: count, dtype: int64

In [48]:
for column in df:
    print (f'{column} {df[column].nunique()}')

customer 9056
state 6
gender 2
education 5
customer_lifetime_value 8212
income 5655
monthly_premium_auto 209
number_of_open_complaints 12
policy_type 3
vehicle_class 4
total_claim_amount 5070

In [14]:
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.split('/').str[1]

In [15]:
for column in df:
    print (df[column].unique())

['RB50392' 'QZ44356' 'AI49188' ... 'TD14365' 'UP19263' 'Y167826']
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'nan']
[nan 'F' 'M']
['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]
['nan' '697953.59' '1288743.17' ... '8163.890428' '7524.442436'
 '2611.836866']
[    0. 48767. 36357. ... 66367. 71941. 21941.]
[ 1000.    94.   108.   106.    68.    69.    67.   101.    71.    93.
   110.    70.    64.    72.    74.    79.    73.    61.   111.    80.
    63.   237.    65.   130.    62.   117.    91.    90.    66.    99.
   103. 35354.   172.    92.   104.   113.   124.   105.   100.   112.
    97.    95.   102.    96.   186.    77.    76.   119.    87.   109.
   107.    88.    85.  6464.   133.    86.    78.    89.   192.   118.
   140.   127.   126.    82.   115.   217.   114.   138.    81.   255.
   150.   123.   116.   190.    98.   159.    84.    83.   152.   136.
   245.   135.  1005.   225.   132.   153.   121.   139.   154.   161.
   156.   171.   244.   183.   176.   230.   129.   177.   181.   196.
   131.   276.   253.   137.   180.   203.   147.   165.   198.   125.
   193.   128.   271.   142. 10202.   206.   182.   189.   160.   295.
   210.   134. 35353.   239.   188.   256.   173.   285.   148.   141.
   197.   199.    nan   214.   175.   167.   194.   164.   222.   215.
   283.   169.   248.   223.   151.   213.   145.   185.   287.   297.
  5353.   201.   149.   146.  7575.   235.   268.   211.   187.   168.
   122.   143.   155.   166.   212.   249.   240.   191.   195.   216.
   144.   179.   232.   158.   207.   184.   238.   229.   220.   178.
   204.   281.   170.   234.   218.   275.   209.   261.   157.   205.
   228.   242.   284.   231.   208.   296.   202.   162.   274.   219.
   247.   290.   226.   163.   298.   266.   254.   252.   174.   286.]
['0' '2' '1' '3' '5' '4' nan]
['Personal Auto' 'Corporate Auto' 'Special Auto' nan]
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury' nan]
[   2.704934 1131.464935  566.472247 ...  541.282007  198.234764
  790.784983]

In [16]:
for column in df:
    non_matching_columns = df.columns[df.dtypes != df.dtypes[0]]
print (non_matching_columns)

Index(['income', 'monthly_premium_auto', 'total_claim_amount'], dtype='object')

In [17]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [18]:
df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)
df['number_of_open_complaints'] = df['number_of_open_complaints'].astype(float)

In [19]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [20]:
for column in df:
    print (df[column].value_counts())

customer
QD28391    2
YB66933    2
LY14355    2
FX36546    2
OT85112    2
          ..
KG49115    1
NT78297    1
TN66124    1
JV99867    1
Y167826    1
Name: count, Length: 9056, dtype: int64
state
California    3152
nan           2937
Oregon        2601
Arizona       1704
Nevada         882
Washington     798
Name: count, dtype: int64
gender
F    4607
M    4408
Name: count, dtype: int64
education
Bachelor                2743
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Name: count, dtype: int64
customer_lifetime_value
16468.220790    6
5246.278375     6
22332.439460    6
4270.034394     6
5107.163002     6
               ..
7477.176362     1
15700.284360    1
2968.077571     1
5452.171237     1
2611.836866     1
Name: count, Length: 8211, dtype: int64
income
0.0        2294
95697.0      13
26876.0       8
61108.0       8
10621.0       8
           ...
26599.0       1
75774.0       1
85412.0       1
42968.0       1
21941.0       1
Name: count, Length: 5655, dtype: int64
monthly_premium_auto
65.0     351
66.0     312
71.0     304
73.0     303
63.0     290
        ...
178.0      1
204.0      1
281.0      1
275.0      1
286.0      1
Name: count, Length: 209, dtype: int64
number_of_open_complaints
0.0    1626
1.0     247
2.0      93
3.0      60
4.0      29
5.0      12
Name: count, dtype: int64
policy_type
Personal Auto     6792
Corporate Auto    1965
Special Auto       380
Name: count, dtype: int64
vehicle_class
Four-Door Car    4641
Two-Door Car     1896
SUV              1774
Luxury            826
Name: count, dtype: int64
total_claim_amount
316.800000    119
292.800000    111
312.000000    108
350.400000    107
321.600000    104
             ...
434.757900      1
389.636991      1
114.743547      1
733.737214      1
790.784983      1
Name: count, Length: 5070, dtype: int64

In [21]:
for column in df:
    if column in non_matching_columns:
        print(df[column].dtypes)

float64
float64
float64

In [22]:
for column in df:
    if column in non_matching_columns:
        print(f"{column} , {df[column].unique()}")
        print (df[column].value_counts())

income , [    0. 48767. 36357. ... 66367. 71941. 21941.]
income
0.0        2294
95697.0      13
26876.0       8
61108.0       8
10621.0       8
           ...
26599.0       1
75774.0       1
85412.0       1
42968.0       1
21941.0       1
Name: count, Length: 5655, dtype: int64
monthly_premium_auto , [ 1000.    94.   108.   106.    68.    69.    67.   101.    71.    93.
   110.    70.    64.    72.    74.    79.    73.    61.   111.    80.
    63.   237.    65.   130.    62.   117.    91.    90.    66.    99.
   103. 35354.   172.    92.   104.   113.   124.   105.   100.   112.
    97.    95.   102.    96.   186.    77.    76.   119.    87.   109.
   107.    88.    85.  6464.   133.    86.    78.    89.   192.   118.
   140.   127.   126.    82.   115.   217.   114.   138.    81.   255.
   150.   123.   116.   190.    98.   159.    84.    83.   152.   136.
   245.   135.  1005.   225.   132.   153.   121.   139.   154.   161.
   156.   171.   244.   183.   176.   230.   129.   177.   181.   196.
   131.   276.   253.   137.   180.   203.   147.   165.   198.   125.
   193.   128.   271.   142. 10202.   206.   182.   189.   160.   295.
   210.   134. 35353.   239.   188.   256.   173.   285.   148.   141.
   197.   199.    nan   214.   175.   167.   194.   164.   222.   215.
   283.   169.   248.   223.   151.   213.   145.   185.   287.   297.
  5353.   201.   149.   146.  7575.   235.   268.   211.   187.   168.
   122.   143.   155.   166.   212.   249.   240.   191.   195.   216.
   144.   179.   232.   158.   207.   184.   238.   229.   220.   178.
   204.   281.   170.   234.   218.   275.   209.   261.   157.   205.
   228.   242.   284.   231.   208.   296.   202.   162.   274.   219.
   247.   290.   226.   163.   298.   266.   254.   252.   174.   286.]
monthly_premium_auto
65.0     351
66.0     312
71.0     304
73.0     303
63.0     290
        ...
178.0      1
204.0      1
281.0      1
275.0      1
286.0      1
Name: count, Length: 209, dtype: int64
total_claim_amount , [   2.704934 1131.464935  566.472247 ...  541.282007  198.234764
  790.784983]
total_claim_amount
316.800000    119
292.800000    111
312.000000    108
350.400000    107
321.600000    104
             ...
434.757900      1
389.636991      1
114.743547      1
733.737214      1
790.784983      1
Name: count, Length: 5070, dtype: int64

In [23]:
columns_with_null = df.columns[df.isnull().any()]
print(columns_with_null)
for column in columns_with_null:
    null_values_column = df[column].isnull().sum()
   

null_counts = df.isnull().sum()
print(null_counts)

Index(['customer', 'gender', 'education', 'customer_lifetime_value', 'income',
       'monthly_premium_auto', 'number_of_open_complaints', 'policy_type',
       'vehicle_class', 'total_claim_amount'],
      dtype='object')
customer                      2937
state                            0
gender                        3059
education                     2937
customer_lifetime_value       2944
income                        2937
monthly_premium_auto          2937
number_of_open_complaints    10007
policy_type                   2937
vehicle_class                 2937
total_claim_amount            2937
dtype: int64

In [24]:
import numpy as np
numeric_columns = df.select_dtypes(include = np.number).columns
print (numeric_columns)

for column in df:
    if column in numeric_columns:
        median_val = df[column].median()
        df[column].fillna(median_val, inplace=True)
    else:
        df[column].fillna("na", inplace=True)

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'number_of_open_complaints', 'total_claim_amount'],
      dtype='object')

In [25]:
columns_with_null = df.columns[df.isnull().any()]
print(columns_with_null)
for column in columns_with_null:
    null_values_column = df[column].isnull().sum()
   

null_counts = df.isnull().sum()
print(null_counts)

Index([], dtype='object')
customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [26]:
for column in df:
    duplicates = df[column].duplicated().sum()
    print(f"duplicates in {column} {duplicates} ")

duplicates in customer 3017
duplicates in state 12068
duplicates in gender 12071
duplicates in education 12068
duplicates in customer_lifetime_value 3862
duplicates in income 6419
duplicates in monthly_premium_auto 11865
duplicates in number_of_open_complaints 12068
duplicates in policy_type 12070
duplicates in vehicle_class 12069
duplicates in total_claim_amount 7004

In [27]:
df = df.drop_duplicates(subset=['customer'])

In [28]:
for column in df:
    duplicates = df[column].duplicated().sum()
    print(f"duplicates in {column} {duplicates} ")

duplicates in customer 0
duplicates in state 9051
duplicates in gender 9054
duplicates in education 9051
duplicates in customer_lifetime_value 911
duplicates in income 3402
duplicates in monthly_premium_auto 8848
duplicates in number_of_open_complaints 9051
duplicates in policy_type 9053
duplicates in vehicle_class 9052
duplicates in total_claim_amount 3987

In [29]:
df.reset_index(drop=True, inplace=True)
df.tail()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
9052,LA72316,California,M,Bachelor,23405.987980,71941.0,73.0,0.0,Personal Auto,Four-Door Car,198.234764
9053,PK87824,California,F,College,3096.511217,21604.0,79.0,0.0,Corporate Auto,Four-Door Car,379.200000
9054,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,0.0,Corporate Auto,Four-Door Car,790.784983
9055,UP19263,California,M,College,7524.442436,21941.0,96.0,0.0,Personal Auto,Four-Door Car,691.200000
9056,Y167826,California,M,College,2611.836866,0.0,77.0,0.0,Corporate Auto,Two-Door Car,369.600000

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [56]:
df4 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv')
df4.shape

(10910, 27)

In [58]:
df4.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [95]:
pivot1df4 = df4.pivot_table(index='sales_channel', columns='response', values=['customer_lifetime_value'], aggfunc='sum').round(2)

In [96]:
pivot1df4

              customer_lifetime_value
response                           No         Yes
sales_channel
Agent                     27360005.24  5697882.61
Branch                    21694650.42  2664550.79
Call Center               15501986.18  1862302.19
Web                       11366553.25  1331079.65

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [101]:
pivot2df4 = df4.pivot_table(index = 'education', columns = 'gender', values = 'customer_lifetime_value', aggfunc = 'mean').round(2)
pivot2df4

gender                      F        M
education
Bachelor              7874.27  7703.60
College               7748.82  8052.46
Doctor                7328.51  7415.33
High School or Below  8675.22  8149.69
Master                8157.05  8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [108]:
pivot3df4 = df4.pivot_table(index = 'policy_type', columns = 'month', values = 'number_of_open_complaints', aggfunc = "sum")
df5 = pivot3df4
print (df5)

month                     1            2
policy_type
Corporate Auto   443.434952   385.208135
Personal Auto   1727.605722  1453.684441
Special Auto      87.074049    95.226817

In [111]:
df5.head()

month                     1            2
policy_type
Corporate Auto   443.434952   385.208135
Personal Auto   1727.605722  1453.684441
Special Auto      87.074049    95.226817

In [115]:
pd.melt(df, id_vars=['policy_type'])
melted_data.head()

   month     policy_type                  Indicator     Value
0      2  Corporate Auto  number_of_open_complaints  0.000000
1      1   Personal Auto  number_of_open_complaints  0.000000
2      2   Personal Auto  number_of_open_complaints  0.000000
3      1  Corporate Auto  number_of_open_complaints  0.000000
4      1   Personal Auto  number_of_open_complaints  0.384256